benchmarkingExperiments/data/initial_experiments/8t8c300rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  8 threads and 8 connections
  Thread calibration: mean lat.: 12.039ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 11.545ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 12.180ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 12.289ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 12.424ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 12.624ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 11.760ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 11.791ms, rate sampling interval: 29ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.49ms   89.78ms 558.08ms   93.78%
    Req/Sec    37.71     14.11   137.00     81.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.86ms
 75.000%   12.85ms
 90.000%   18.59ms
 99.000%  496.13ms
 99.900%  543.74ms
 99.990%  553.98ms
 99.999%  558.59ms
100.000%  558.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.933     0.000000            1         1.00
       7.607     0.100000         1500         1.11
       8.703     0.200000         3006         1.25
       9.591     0.300000         4514         1.43
      10.263     0.400000         6011         1.67
      10.863     0.500000         7517         2.00
      11.175     0.550000         8270         2.22
      11.487     0.600000         9018         2.50
      11.871     0.650000         9751         2.86
      12.295     0.700000        10502         3.33
      12.855     0.750000        11258         4.00
      13.183     0.775000        11630         4.44
      13.583     0.800000        12000         5.00
      14.103     0.825000        12375         5.71
      14.839     0.850000        12752         6.67
      15.903     0.875000        13126         8.00
      16.863     0.887500        13313         8.89
      18.591     0.900000        13502        10.00
      23.359     0.912500        13688        11.43
      39.871     0.925000        13875        13.33
     121.855     0.937500        14063        16.00
     181.759     0.943750        14157        17.78
     225.919     0.950000        14250        20.00
     268.799     0.956250        14344        22.86
     321.279     0.962500        14438        26.67
     373.503     0.968750        14532        32.00
     399.615     0.971875        14579        35.56
     419.839     0.975000        14625        40.00
     441.343     0.978125        14672        45.71
     458.239     0.981250        14720        53.33
     472.063     0.984375        14767        64.00
     476.415     0.985938        14790        71.11
     483.839     0.987500        14815        80.00
     491.519     0.989062        14836        91.43
     499.455     0.990625        14860       106.67
     506.367     0.992188        14883       128.00
     509.695     0.992969        14895       142.22
     513.279     0.993750        14907       160.00
     515.839     0.994531        14918       182.86
     519.935     0.995313        14930       213.33
     524.799     0.996094        14944       256.00
     525.311     0.996484        14948       284.44
     528.383     0.996875        14954       320.00
     530.431     0.997266        14961       365.71
     531.967     0.997656        14966       426.67
     535.039     0.998047        14971       512.00
     535.551     0.998242        14974       568.89
     539.135     0.998437        14977       640.00
     541.183     0.998633        14980       731.43
     542.719     0.998828        14983       853.33
     543.743     0.999023        14986      1024.00
     544.255     0.999121        14987      1137.78
     545.791     0.999219        14989      1280.00
     546.303     0.999316        14991      1462.86
     546.815     0.999414        14992      1706.67
     549.375     0.999512        14993      2048.00
     549.887     0.999561        14994      2275.56
     551.423     0.999609        14996      2560.00
     551.423     0.999658        14996      2925.71
     551.423     0.999707        14996      3413.33
     551.935     0.999756        14997      4096.00
     551.935     0.999780        14997      4551.11
     553.983     0.999805        14998      5120.00
     553.983     0.999829        14998      5851.43
     553.983     0.999854        14998      6826.67
     554.495     0.999878        14999      8192.00
     554.495     0.999890        14999      9102.22
     554.495     0.999902        14999     10240.00
     554.495     0.999915        14999     11702.86
     554.495     0.999927        14999     13653.33
     558.591     0.999939        15000     16384.00
     558.591     1.000000        15000          inf
#[Mean    =       33.489, StdDeviation   =       89.779]
#[Max     =      558.080, Total count    =        15000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18002 requests in 1.00m, 3.21MB read
Requests/sec:    299.99
Transfer/sec:     54.79KB