benchmarkingExperiments/data/initial_experiments/8t8c400rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  8 threads and 8 connections
  Thread calibration: mean lat.: 12.014ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 12.710ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 12.142ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 12.165ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 12.184ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 12.106ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 11.813ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 13.208ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    54.41ms  148.61ms 768.00ms   92.34%
    Req/Sec    50.63     19.99   185.00     72.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.81ms
 75.000%   13.02ms
 90.000%   52.00ms
 99.000%  693.76ms
 99.900%  748.03ms
 99.990%  764.93ms
 99.999%  768.51ms
100.000%  768.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.827     0.000000            1         1.00
       7.487     0.100000         2002         1.11
       8.623     0.200000         4019         1.25
       9.607     0.300000         6001         1.43
      10.287     0.400000         8008         1.67
      10.815     0.500000        10018         2.00
      11.095     0.550000        11020         2.22
      11.391     0.600000        12000         2.50
      11.759     0.650000        13017         2.86
      12.279     0.700000        14005         3.33
      13.015     0.750000        15001         4.00
      13.567     0.775000        15503         4.44
      14.263     0.800000        16002         5.00
      15.095     0.825000        16502         5.71
      16.479     0.850000        17002         6.67
      23.471     0.875000        17500         8.00
      32.575     0.887500        17750         8.89
      51.999     0.900000        18001        10.00
      89.407     0.912500        18250        11.43
     222.975     0.925000        18500        13.33
     381.951     0.937500        18751        16.00
     457.215     0.943750        18875        17.78
     512.511     0.950000        19000        20.00
     555.519     0.956250        19129        22.86
     592.895     0.962500        19250        26.67
     631.807     0.968750        19375        32.00
     642.559     0.971875        19438        35.56
     652.287     0.975000        19501        40.00
     662.527     0.978125        19566        45.71
     668.671     0.981250        19626        53.33
     676.351     0.984375        19688        64.00
     681.471     0.985938        19719        71.11
     686.591     0.987500        19750        80.00
     691.711     0.989062        19786        91.43
     696.319     0.990625        19814       106.67
     701.951     0.992188        19847       128.00
     706.559     0.992969        19860       142.22
     713.727     0.993750        19875       160.00
     719.871     0.994531        19893       182.86
     724.479     0.995313        19908       213.33
     730.111     0.996094        19922       256.00
     732.671     0.996484        19931       284.44
     735.231     0.996875        19941       320.00
     736.255     0.997266        19947       365.71
     739.839     0.997656        19955       426.67
     741.375     0.998047        19961       512.00
     743.423     0.998242        19965       568.89
     744.959     0.998437        19969       640.00
     746.495     0.998633        19973       731.43
     747.519     0.998828        19977       853.33
     749.055     0.999023        19981      1024.00
     750.079     0.999121        19983      1137.78
     752.127     0.999219        19985      1280.00
     755.199     0.999316        19988      1462.86
     755.711     0.999414        19989      1706.67
     758.271     0.999512        19991      2048.00
     760.319     0.999561        19992      2275.56
     760.831     0.999609        19993      2560.00
     761.343     0.999658        19994      2925.71
     762.367     0.999707        19995      3413.33
     762.879     0.999756        19996      4096.00
     762.879     0.999780        19996      4551.11
     764.415     0.999805        19997      5120.00
     764.415     0.999829        19997      5851.43
     764.927     0.999854        19998      6826.67
     764.927     0.999878        19998      8192.00
     764.927     0.999890        19998      9102.22
     765.439     0.999902        19999     10240.00
     765.439     0.999915        19999     11702.86
     765.439     0.999927        19999     13653.33
     765.439     0.999939        19999     16384.00
     765.439     0.999945        19999     18204.44
     768.511     0.999951        20000     20480.00
     768.511     1.000000        20000          inf
#[Mean    =       54.408, StdDeviation   =      148.605]
#[Max     =      768.000, Total count    =        20000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24000 requests in 1.00m, 4.28MB read
Requests/sec:    399.94
Transfer/sec:     73.04KB