benchmarkingExperiments/data/initial_experiments/one.out
Running 10s test @ http://172.31.22.216:5000/yolo
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.67s     2.09s    7.24s    57.83%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.73s 
 75.000%    5.51s 
 90.000%    6.51s 
 99.000%    7.17s 
 99.900%    7.23s 
 99.990%    7.24s 
 99.999%    7.24s 
100.000%    7.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.351     0.000000            1         1.00
     718.847     0.100000          276         1.11
    1512.447     0.200000          552         1.25
    2174.975     0.300000          828         1.43
    3006.463     0.400000         1104         1.67
    3727.359     0.500000         1380         2.00
    4073.471     0.550000         1518         2.22
    4419.583     0.600000         1657         2.50
    4755.455     0.650000         1795         2.86
    5124.095     0.700000         1932         3.33
    5509.119     0.750000         2070         4.00
    5672.959     0.775000         2139         4.44
    5836.799     0.800000         2208         5.00
    6000.639     0.825000         2277         5.71
    6172.671     0.850000         2347         6.67
    6348.799     0.875000         2416         8.00
    6430.719     0.887500         2450         8.89
    6512.639     0.900000         2485        10.00
    6623.231     0.912500         2519        11.43
    6709.247     0.925000         2553        13.33
    6803.455     0.937500         2588        16.00
    6844.415     0.943750         2605        17.78
    6885.375     0.950000         2622        20.00
    6938.623     0.956250         2640        22.86
    6979.583     0.962500         2657        26.67
    7020.543     0.968750         2675        32.00
    7041.023     0.971875         2683        35.56
    7061.503     0.975000         2692        40.00
    7094.271     0.978125         2701        45.71
    7118.847     0.981250         2709        53.33
    7135.231     0.984375         2717        64.00
    7147.519     0.985938         2722        71.11
    7159.807     0.987500         2727        80.00
    7167.999     0.989062         2730        91.43
    7180.287     0.990625         2735       106.67
    7188.479     0.992188         2739       128.00
    7192.575     0.992969         2741       142.22
    7200.767     0.993750         2744       160.00
    7204.863     0.994531         2746       182.86
    7213.055     0.995313         2749       213.33
    7217.151     0.996094         2751       256.00
    7217.151     0.996484         2751       284.44
    7221.247     0.996875         2753       320.00
    7221.247     0.997266         2753       365.71
    7225.343     0.997656         2754       426.67
    7229.439     0.998047         2756       512.00
    7229.439     0.998242         2756       568.89
    7229.439     0.998437         2756       640.00
    7233.535     0.998633         2758       731.43
    7233.535     0.998828         2758       853.33
    7233.535     0.999023         2758      1024.00
    7233.535     0.999121         2758      1137.78
    7233.535     0.999219         2758      1280.00
    7237.631     0.999316         2759      1462.86
    7237.631     0.999414         2759      1706.67
    7237.631     0.999512         2759      2048.00
    7237.631     0.999561         2759      2275.56
    7237.631     0.999609         2759      2560.00
    7241.727     0.999658         2760      2925.71
    7241.727     1.000000         2760          inf
#[Mean    =     3669.029, StdDeviation   =     2090.859]
#[Max     =     7237.632, Total count    =         2760]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2761 requests in 10.00s, 504.21KB read
Requests/sec:    276.10
Transfer/sec:     50.42KB